[
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "1. Our colleague creates value for their Team at a level consistent with their seniority level (Junior / Intermediate / Senior / Technical Lead / Technical Manager)",
    "Current Review": "5 - Consistently exceeds expectations",
    "Notes": "Great and advanced UI skils.\nCan easely provide solid solutions for any challange presented.\n\n+ context switching",
    "Previous Review": "5 - Consistently exceeds expectations",
    "Notes__1": "Consistent in this, demonstrates constantly that she is always ready for all the technical challenges she is facing not only on activities related with the projects that is constantly working on but also with unpredicted activities.",
    "Previous Review__1": "5 - Consistently exceeds expectations",
    "Previous Notes": "Corina is a key contributor for delivering value not only on Geopod Team but also outside of it, NGSUI etc. , she is constantly pushing the expectations boundaries in terms of value delivery by taking ownership and pushing independently forward de development, requirements clarification, planning and other activities that she sees value in them and she can contribute in order to be delivered in a timely manner."
  },
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "2. Our colleague proactively seeks to understand, apply and comply with industry standards that the Team has agreed to, to their work. This may be evidenced by seeking guidance from more senior members of their team, reading relevant materials, attending conferences, enrolling in training and certifications, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "She's proactively does research on industry standards and best practices and offers support for her team \n\nenhance UI skills + AWS + desire towards technical doccumentation",
    "Previous Review": "4 - Frequently",
    "Notes__1": "She made improvements on proactivity on this topic, asa margin of improvement she needs to work a little bit more on finding training opportunities or certifications.",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "She is always having a very good understanding of standards approached by the team and doesn't have difficulties on applying them, on an improvement note she needs to improve a little bin on the proactivity side where she needs to research/study more industry standards and challenge more the solutions that needs improvements etc."
  },
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "3. As a technology and engineering organization, we depend on the consistent application of agreed methodologies of work in collaboration with our clients (e.g.: agile scrum) in order to efficiently and reliably meet our commitments with a high standard of quality. Our colleague proactively seeks to understand these processes in collaboration with our client and perform their role in adherence to these processes/ methodologies.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent.\n\nShe's a good \"inspector\" of the process, providing feedback and improvements",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Corina is a constant advocate for process improvement and the correct usage of the agile methodology that we are using, she provides always relevant feedback in improvements ideas about the process but more than this she is always also paying attention about the progress of the improvements we discussed and agreed to work on as a team."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "4. At varying times, the client may seek to optimize for short term speed vs. long term efficiency. A pragmatic colleague understands this context at all times and strives to adapt their approach and mindset according to our customers current needs. For each unit of work (feature or task), our colleague seeks to understand where on the speed-to-efficiency continuum they should adapt their work so that they can best adapt their solution to the client’s current needs. Within these constraints, our colleague continually seeks the solutions that avoid unnecessary complexity.",
    "Current Review": "5 - Always",
    "Notes": "She is great at understanding the client's needs, paying attention to details.",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Corina is appreciated by the entire team for her pragmatism and independence on understanding the client needs and optimising for speed-to-efficiency but always keeping an eye on the quality of the solutions and they evolution in time."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "5. As members of product engineering teams, we cannot be successful in creating value for our teams and our clients unless we understand the source and definition of that value. For each unit of work (feature or task), our colleague proactively seeks to clarify requirements and tasks as well as seeking to understand acceptance criteria or the desired outcome.",
    "Current Review": "5 - Always",
    "Notes": "She constantly makes sure requirements are clear, for each unit of work",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Clarifying requirements where they are not clear or complete is an activity that Corina is doing constantly and is able to do this without any support arriving always to a clear understanding of the problem to be resolved, more that this where is no support or lack of informations she compensates by writing requirements or acceptance criteria in order to move forward."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "6. As members of teams that depend on people and technology, there is a never ending supply of flaws, gaps, and items to be improved. While constructive criticism is valuable, much more valuable are the solutions that address those issues. When identifying problems or challenges, rather than simply complaining about them, our Colleague is solution oriented, seeking to identify and implement solutions that generate value for the client, the team, or QC..",
    "Current Review": "5 - Always",
    "Notes": "Always solution oriented as an individual and she pushes the team to perform smarter and offers ideas for how to make the team and our work more effective. \n\nMapshots",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent, still needs to improve her involvement in the more complex technical debates",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly having constructive debates on the solutions, as an improvement idea a slightly more initiative and involvement in solutions debates will bring her to the next level."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "7. Maximizing value for the team depends on the team’s ability to quickly and efficiently explore a diversity of approaches and solutions. When faced with unfamiliar options or approaches, our colleague does not dismiss them easily or just because they were thought of by someone else, but rather seeks to understand and improve when appropriate.",
    "Current Review": "4 - Frequently",
    "Notes": "She is very open to unfamiliar approaches and embraces working on such work.\n\nShe knows she’s skilled and exercises that when she sees the chance, adding value to the product\n\nMM, xPod",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "We have learned during the last period of time that Corina handles very well the unfamiliar solutions, technologies or approaches she has a very good capacity of researching/learning/understanding them and she doesn't dismiss easily because they are harder or thought by someone else. She can improve here by exposing herself even more to similar situations."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "8. Our colleague is ever mindful of commitments that have been made, either by them personally or by their team. This colleague goes above and beyond their normal efforts when necessary in order to honor those commitments.",
    "Current Review": "5 - Always",
    "Notes": "No change",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent ++",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always mindful of team commitments, and in her case not only team commitments but more than that, is constantly going above and beyond and as example we need to consider the constant workload that she is handling in both Geopod and NGSUI"
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "9. Our Colleague’s team members know that they can depend and rely on him/her to expend all reasonable efforts in order to honor the commitments that have been made.",
    "Current Review": "5 - Always",
    "Notes": "No change",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "This is something that was noticed and provided as feedback by all the team members, the fact that everybody can rely on her in order to honor the commitments that were made by the team."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "10. When the team or their fellow team members are facing a challenge (e.g. operational, deadline, technical) our Colleague proactively seeks to understand how they can help or support in overcoming the challenge.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly available for helping the others, not only by being available but also by having independent initiatives for helping them"
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "11. When faced with a circumstance where our Colleague disagrees with a decision made by the client, a team member, or their manager, our Colleague can constructively disagree, and commit to the decision with which they disagree, and then actively work to support a successful outcome for that decision.",
    "Current Review": "4 - Frequently",
    "Notes": "When it comes to disagreements, she can commit to the decision made and successfully support it, but before that she makes sure that the solution was carefully analysed, providing a high quality increment",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Didn't have situations in which Corina was not able to disagree and commit, as a matter a fact I would like to have more situations/initiatives in which she disagrees technically in order to stimulate more constructive discussions"
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "12. Our colleague notices when their less experienced team members might be struggling with new concepts or tasks and proactively offers coaching or guidance.",
    "Current Review": "4 - Frequently",
    "Notes": "She also has the patience to offer good support, know how when someone is struggling at certain topics",
    "Previous Review": "4 - Frequently",
    "Notes__1": "This happened frequently with the less experienced developers that contributed on ngsui, needs to improve more on coaching approaches and techniques",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "This is an area that she is doing well bu she needs to do this more proactively and try more coaching less experienced colleagues because she can share a lot with them in terms of solutions, approaches, etc. and will also develop her abilities for a future role."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "13. When approached by a team member for guidance or assistance, our Colleague readily and enthusiastically renders such assistance.",
    "Current Review": "5 - Always",
    "Notes": "Always open to help others",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly available for assisting others"
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "14. Our Colleague proactively seeks available opportunities (either within QC or outside of QC) to further develop their professional skills. These opportunities might include professional certifications, classes (online or in person), public speaking opportunities, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "She openly addressed extending her professional skills, filling in knowledge gaps outside her area of expertise",
    "Previous Review": "3 - Sometimes",
    "Notes__1": "Improved but still needs to create more opportunities for developing her professional skills",
    "Previous Review__1": "2 - Rarely",
    "Previous Notes": "This is something that we have discussed constantly during the last 6 months, is an area that she compromised on in order sustain the amount of work she was committing for all the projects she was involved in. She is having great capabilities of learning in stepping up in terms of skills  and experience and she demonstrated this in the last period when she was exposed to tasks that required her to learn more but we need to find a way that gives her opportunities to learn and develop not only the tasks are requiring it."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "15. Our Colleague proactively seeks to share their unique skills or knowledge within either their immediate team or the broader QC community. This may include such behaviors as sharing articles of professional interest that are relevant to the QC community, speaking at internal QC events, or seeking to advance a community of like minded practitioners of their craft within the QC community.",
    "Current Review": "3 - Sometimes",
    "Notes": "Consistent. Would like her to share more of her knwowledge, having a valuable knowledge package",
    "Previous Review": "3 - Sometimes",
    "Notes__1": "Does it when needed still needs to work on proactivity",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "When needed she is doing it but need to be more proactive on this considering the fact that she has a lot to share with others."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "16. Our Colleague actively seeks as well as constructively receives feedback regarding their performance, behavior, and interactions with their immediate team. When presented with both negative and positive feedback, our Colleague strives to understand the feedback and identify opportunities for improvement. Our Colleague does not get defensive or act to criticize the provider of feedback.",
    "Current Review": "4 - Frequently",
    "Notes": "She's contantly open to constructive feedback targeted toward her profesional growth, even when discussing about areas outside her current expertise",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Didn't have any situation in which Corina was defensive or critic on the feedback she was receiving, she can improve on seeking more opportunities for personal improvement"
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "17. Our Colleague is enthusiastic, effective, and proactive when communicating (verbal or written) in INTERNAL team or QC settings.",
    "Current Review": "4 - Frequently",
    "Notes": "No change",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly communicating effectively"
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "18. Our Colleague is enthusiastic, effective, and proactive when communicating (verbal or written) in CLIENT facing or more formal EXTERNAL situations.  These will likely include daily standups, client product demos, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "No change",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly communicating effectively, an improvement area would be be more proactive on improving her skills/or seeking more opportunities  for writing technical documentation."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "19. Good communications are essential for creating visibility and understanding in any client service business or any environment where other team members depend on our efforts.  Our Colleague proactively seeks to communicate the amount of information that is necessary and sufficient to create this visibility both for their team and the Client. This includes the timely communication of the current status of their efforts upon the team's behalf, their availability during business hours, and any obstacles where they may need support in order to be successful in their respective role.",
    "Current Review": "5 - Always",
    "Notes": "She’s great at describing her work and presenting to groups.Mapshots",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "This is something that Corina does very well with the team and the Client."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "20. In teams of varied personalities and backgrounds, it is inevitable that team members may disagree or conflict on issues of substance or personality.  Our Colleague navigates conflict situations constructively and understands how to defuse situations without letting them become personal. This includes the consistent ability to communicate a negative message (“I disagree with you for X reasons”) while maintaining a personal respect for their team mate and their role.",
    "Current Review": "3 - Sometimes",
    "Notes": "Sometimes her reactions may not be perceived that well, especially for peaople out of context.\n\nWhen dealing with conflicts or disagreements, she may take things to personal, which can escalade the conflict",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "We didn't encounter conflicts in the last period that was not handled constructively or well by Corina. She is always treating the others with respect."
  }
]
