[
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "1. Our colleague creates value for their Team at a level consistent with their seniority level (Junior / Intermediate / Senior / Technical Lead / Technical Manager)",
    "Current Review": "5 - Consistently exceeds expectations",
    "Notes": "Chris brings value whenever possible, to any product or challange he's facig, even outside his area of expertise. He's not only limited to add value on the technical sides,being very helpful in enhancing the teams processes, communication, mentoring other team members.\n\nUI + Sanity, Infrastructure, SCRUM.",
    "Previous Review": "4 - Occasionally exceeds expectations",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Occasionally exceeds expectations",
    "Previous Notes": "Chris has been promoted in the new role in the last months and also after that he started to surprise us by continuing to push the expectations limits and creating constantly value for the team and lately not only for the team but also for other enterprise level initiatives"
  },
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "2. Our colleague proactively seeks to understand, apply and comply with industry standards that the Team has agreed to, to their work. This may be evidenced by seeking guidance from more senior members of their team, reading relevant materials, attending conferences, enrolling in training and certifications, etc.",
    "Current Review": "5 - Always",
    "Notes": "Besides understanding and applying, he is actively searching and suggesting ways the entire team/product could evolve and how value be enhanced.\n\nNextJS boilerplate\nSCRUM\nAWS",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "If is something that is guaranteed that Chris is doing constantly is his focus on seeking the best industry standards to apply, understanding them and the value that they can bring, constantly rising discussions about them inside of the team or by independently searching for materials and opportunities to learn about them."
  },
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "3. As a technology and engineering organization, we depend on the consistent application of agreed methodologies of work in collaboration with our clients (e.g.: agile scrum) in order to efficiently and reliably meet our commitments with a high standard of quality. Our colleague proactively seeks to understand these processes in collaboration with our client and perform their role in adherence to these processes/ methodologies.",
    "Current Review": "4 - Frequently",
    "Notes": "As mentioned above, Chis is always a constant contributor for improving our process.\n\nHe proactively tries to understand where the process can be improved.\n\nOrg. refinement",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Chis is always a constant contributor for improving our process, he always provides valuable feedback and collaborate with all the team members and client for improving our process/way of work."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "4. At varying times, the client may seek to optimize for short term speed vs. long term efficiency. A pragmatic colleague understands this context at all times and strives to adapt their approach and mindset according to our customers current needs. For each unit of work (feature or task), our colleague seeks to understand where on the speed-to-efficiency continuum they should adapt their work so that they can best adapt their solution to the client’s current needs. Within these constraints, our colleague continually seeks the solutions that avoid unnecessary complexity.",
    "Current Review": "4 - Frequently",
    "Notes": "Besides adapting his approach for each unit of work, he's helped a lot planning and designing solutions where the final input was a ballance of requirements, efficency, quallity and a short deadline. \n\nMapShots",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "He is constantly adapting his approach according to current needs and and avoids unnecessary complexity in the solutions he is approaching in the same time not compromising the the quality of the solutions he is delivering."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "5. As members of product engineering teams, we cannot be successful in creating value for our teams and our clients unless we understand the source and definition of that value. For each unit of work (feature or task), our colleague proactively seeks to clarify requirements and tasks as well as seeking to understand acceptance criteria or the desired outcome.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent",
    "Previous Review": "4 - Frequently",
    "Notes__1": "He is a constant contributor on the design and requirements discussions that helps clarifying the requirements, acceptance criteria and the business needs. He is very well connected also with the product vision and brings constantly very good design or product feedback.",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "He is a constant contributor on the design and requirements discussions that helps clarifying the requirements, acceptance criteria and the business needs. He is very well connected also with the product vision and brings constantly very good design or product feedback."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "6. As members of teams that depend on people and technology, there is a never ending supply of flaws, gaps, and items to be improved. While constructive criticism is valuable, much more valuable are the solutions that address those issues. When identifying problems or challenges, rather than simply complaining about them, our Colleague is solution oriented, seeking to identify and implement solutions that generate value for the client, the team, or QC..",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Always solution oriented, and always focused on solutions that resolves client problems and delivers value to the clients that are using the product.",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always solution oriented, and always focused on solutions that resolves client problems and delivers value to the clients that are using the product."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "7. Maximizing value for the team depends on the team’s ability to quickly and efficiently explore a diversity of approaches and solutions. When faced with unfamiliar options or approaches, our colleague does not dismiss them easily or just because they were thought of by someone else, but rather seeks to understand and improve when appropriate.",
    "Current Review": "4 - Frequently",
    "Notes": "When faced with unfamiliar approaches he's not dismissing them at all, in fact he is an active contributor, listening, understanding, adapting and proposing enhancements if possible tosuggested approach.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Exploring different approaches and solutions is something that he is very passionate about and demonstrates that he is always challenging himself also in this new role going always more and more in a more unknown and complex territory that gives him the possibility to experiment and learn more."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "8. Our colleague is ever mindful of commitments that have been made, either by them personally or by their team. This colleague goes above and beyond their normal efforts when necessary in order to honor those commitments.",
    "Current Review": "5 - Always",
    "Notes": "You can allways rely on Chris to honor his commitments and is a helping hand for the team in order to reach its commitments",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly focused on the commitments made by the team is frequently doing more than expected for honouring the team commitments."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "9. Our Colleague’s team members know that they can depend and rely on him/her to expend all reasonable efforts in order to honor the commitments that have been made.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "With the complexity of the application growing he is becomming one of the key members of the team and the other team members always rely on him when needed for unlocking them on complex tasks",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "The entire team can rely on him in order to achieve the teams goals, this has beed expressed also during the feedback that we have gathered from all the team members."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "10. When the team or their fellow team members are facing a challenge (e.g. operational, deadline, technical) our Colleague proactively seeks to understand how they can help or support in overcoming the challenge.",
    "Current Review": "5 - Always",
    "Notes": "Consistent++",
    "Previous Review": "5 - Always",
    "Notes__1": "Always available and involved when a challenge is occuring for the other colleagues",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly available and proactive for supporting the other team members with their challenges"
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "11. When faced with a circumstance where our Colleague disagrees with a decision made by the client, a team member, or their manager, our Colleague can constructively disagree, and commit to the decision with which they disagree, and then actively work to support a successful outcome for that decision.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Didn't find situations in which he was not able to disagree and commit, even if he constantly challenges solutions implementations etc. but his interactions are always leading to constructive discussions"
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "12. Our colleague notices when their less experienced team members might be struggling with new concepts or tasks and proactively offers coaching or guidance.",
    "Current Review": "4 - Frequently",
    "Notes": "Chris proactively offers his help and expertise to the entire team. Coaching is something he's made for, recognised by the entire team",
    "Previous Review": "4 - Frequently",
    "Notes__1": "He has improved his coaching techniques by being more exposed to this and by constantly seeking feedback and improvements suggestions from the more experienced colleagues.",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "We have started to expose Chris to coaching by giving him the responsibility to coach Matei and he did a very good job with this and helped a lot in pointing Matei in the right directions on the solutions, approaches, learning areas etc. Is something that Chris has very good potential and enthusiasm, he needs needs to improve his coaching techniques/abilities and expose himself more to this type of activities even outside of our team."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "13. When approached by a team member for guidance or assistance, our Colleague readily and enthusiastically renders such assistance.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always providing assistance"
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "14. Our Colleague proactively seeks available opportunities (either within QC or outside of QC) to further develop their professional skills. These opportunities might include professional certifications, classes (online or in person), public speaking opportunities, etc.",
    "Current Review": "5 - Always",
    "Notes": "Consistent++\n\n- SCRUM & AWS\n- Still needs more initiative on public speaking outside of the team.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent, still needs more initiative on public speaking outside of the team.",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Frequently seeking learning opportunities, needs a little bit more structure to it and needs to have more initiative on public speaking outside of our team."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "15. Our Colleague proactively seeks to share their unique skills or knowledge within either their immediate team or the broader QC community. This may include such behaviors as sharing articles of professional interest that are relevant to the QC community, speaking at internal QC events, or seeking to advance a community of like minded practitioners of their craft within the QC community.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent outside immediate team",
    "Previous Review": "3 - Sometimes",
    "Notes__1": "No improvement here, still needs to have more initiative on sharing his skills outside of the team with broader audience",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "He is one of our main drivers of the internal knowledge sharing initiatives, he constantly bring topics to discussions, presentations, etc. he is sharing his skills constantly inside of the team, needs to have more initiative outside of the team."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "16. Our Colleague actively seeks as well as constructively receives feedback regarding their performance, behavior, and interactions with their immediate team. When presented with both negative and positive feedback, our Colleague strives to understand the feedback and identify opportunities for improvement. Our Colleague does not get defensive or act to criticize the provider of feedback.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Constantly seeking for feedback, he doesn't miss an 1on1 session even if he has to chase you till is happening :), always trying to understand what are the opportunities for improvement. Didn't find situations in which he was defensive or criticised who provided the feedback",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Constantly seeking for feedback, he doesn't miss an 1on1 session even if he has to chase you till is happening :), always trying to understand what are the opportunities for improvement. Didn't find situations in which he was defensive or criticised who provided the feedback"
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "17. Our Colleague is enthusiastic, effective, and proactive when communicating (verbal or written) in INTERNAL team or QC settings.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent\n\nKnows how to ask correct questions during demos",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Very proactive on communication, both verbal and written, speaking of written he is probably the one that have most initiatives in this direction compared with other team members."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "18. Our Colleague is enthusiastic, effective, and proactive when communicating (verbal or written) in CLIENT facing or more formal EXTERNAL situations.  These will likely include daily standups, client product demos, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "He maintains the same level of communication also with the client or external facing situations."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "19. Good communications are essential for creating visibility and understanding in any client service business or any environment where other team members depend on our efforts.  Our Colleague proactively seeks to communicate the amount of information that is necessary and sufficient to create this visibility both for their team and the Client. This includes the timely communication of the current status of their efforts upon the team's behalf, their availability during business hours, and any obstacles where they may need support in order to be successful in their respective role.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Chris communicates effectively and is able to create visibility both for the team and the client."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "20. In teams of varied personalities and backgrounds, it is inevitable that team members may disagree or conflict on issues of substance or personality.  Our Colleague navigates conflict situations constructively and understands how to defuse situations without letting them become personal. This includes the consistent ability to communicate a negative message (“I disagree with you for X reasons”) while maintaining a personal respect for their team mate and their role.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always treating everybody with respect, didn't have any situation of conflict that was not handled well by Chris"
  }
]
