[
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "1. Our colleague creates value for their Team at a level consistent with their seniority level (Junior / Intermediate / Senior / Technical Lead / Technical Manager)",
    "Current Review": "5 - Consistently exceeds expectations",
    "Notes": "He's learning at 300% \n\nHis main focus is to create value and quality for each unit of work he's working on.\n\nThis goes beyond his normal day to day duties, diving into the DevOps territory.",
    "Previous Review": "5 - Consistently exceeds expectations",
    "Notes__1": "Constantly exceeds expectations for a junior, he was able to take full ownership of Mapmaker api after Daniel was left and not only maintaned properly but also pushed forward the improvements and also was able to deliver complex solutions for improving the api services, for example the autoscaling solution thta was fully implemented by him and also managed the interraction with devops team etc. All this happened with a small amount of guidance",
    "Previous Review__1": "4 - Occasionally exceeds expectations",
    "Previous Notes": "As a junior developer Matei had a quick ramp-up on our project and the technologies needed for contributing, from the first weeks on the team he was eager to work on the project and deliver new features, from time to time we actually needed to hold him back from this in order to focus him more towards learning and consolidating his skills more in order to deliver even more value in the future."
  },
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "2. Our colleague proactively seeks to understand, apply and comply with industry standards that the Team has agreed to, to their work. This may be evidenced by seeking guidance from more senior members of their team, reading relevant materials, attending conferences, enrolling in training and certifications, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "Matei is investing a lot in complying and most of all UNDERSTANDING agreed industry standards and their needs.\n\nHe's interested and readyng tech related materials, EVEN AS A HOBBY.\n\nMay need to be encouraged towards certifications ???",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Respect to the initial period Matei learned and applied a different approach of developing qualitative solutions by being more focused on industry standards.",
    "Previous Review__1": "2 - Rarely",
    "Previous Notes": "This is an aspect that when Matei joined didn't have it at all but we have started to work on it and was starting to improve on this, still needs to work on to have more initiative and learn more about it but but is starting to improve in this direction."
  },
  {
    "Core area": "Domain Competence",
    "Expected behaviour": "3. As a technology and engineering organization, we depend on the consistent application of agreed methodologies of work in collaboration with our clients (e.g.: agile scrum) in order to efficiently and reliably meet our commitments with a high standard of quality. Our colleague proactively seeks to understand these processes in collaboration with our client and perform their role in adherence to these processes/ methodologies.",
    "Current Review": "4 - Frequently",
    "Notes": "Good application of the SCRUM framework. \n\nHe recently invested time to learn and further understand the SCRUM framework.\n\nHe has the desire to be a to do everything perfect. There are scenarios sometimes when there is a lack of transparency, extending his work beyound requirements or skipping certain release processes.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "He has adopted very quick out process and way of working, is frequently manifesting interest and is trying to understand more about the process and methodology where doesn't have experience or knowledge."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "4. At varying times, the client may seek to optimize for short term speed vs. long term efficiency. A pragmatic colleague understands this context at all times and strives to adapt their approach and mindset according to our customers current needs. For each unit of work (feature or task), our colleague seeks to understand where on the speed-to-efficiency continuum they should adapt their work so that they can best adapt their solution to the client’s current needs. Within these constraints, our colleague continually seeks the solutions that avoid unnecessary complexity.",
    "Current Review": "4 - Frequently",
    "Notes": "Most of the time he understand the client's needs and constraints and adapts his implementations.\n\nWhen there is more freedom, he's sometimes getting lost in thinking ahead, which could lead into to much complexity.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "He improved his experience and as a result his decisions were better, more than this he learned and applied better divide and conquer remained more focused on the things to be resolved",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "Even if he is always seeking for this kind of optimisations his lack of experience and approaches he was used with on previous jobs he is frequently getting lost in thinking at too many problems in the same time or thinking too far away from the actual needs and this requires some time interventions for helping him understand this kind of optimisations, we are working on right now with him for getting better at divide and conquer and with more exercise he has the potential to improve on this."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "5. As members of product engineering teams, we cannot be successful in creating value for our teams and our clients unless we understand the source and definition of that value. For each unit of work (feature or task), our colleague proactively seeks to clarify requirements and tasks as well as seeking to understand acceptance criteria or the desired outcome.",
    "Current Review": "4 - Frequently",
    "Notes": "Matei is frequently trying to clarify requirements that are not clear or he doesn't understand.\n\nSometimes he needs to be checked to focus only on the desired outcome and to not expand into other implementations.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Matei is frequently trying to clarify requirements that are not clear or he doesn't understand, he only lacks in experience and methods for clarifying them."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "6. As members of teams that depend on people and technology, there is a never ending supply of flaws, gaps, and items to be improved. While constructive criticism is valuable, much more valuable are the solutions that address those issues. When identifying problems or challenges, rather than simply complaining about them, our Colleague is solution oriented, seeking to identify and implement solutions that generate value for the client, the team, or QC..",
    "Current Review": "5 - Always",
    "Notes": "No change",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Didn't encounter till now a situation in which he complained about or didn't try to contribute constructively with his knowledge and experience to a solution."
  },
  {
    "Core area": "Pragmatism",
    "Expected behaviour": "7. Maximizing value for the team depends on the team’s ability to quickly and efficiently explore a diversity of approaches and solutions. When faced with unfamiliar options or approaches, our colleague does not dismiss them easily or just because they were thought of by someone else, but rather seeks to understand and improve when appropriate.",
    "Current Review": "5 - Always",
    "Notes": "He treats unfamiliar approaches with enthuziasm and is constantly seekeing opportonuties to improve his working experience.",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Being new in the team and in the same time working with new technologies and methodologies he is frequently exposed with unfamiliar solutions or approaches and is always eager to understand more and learn about them."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "8. Our colleague is ever mindful of commitments that have been made, either by them personally or by their team. This colleague goes above and beyond their normal efforts when necessary in order to honor those commitments.",
    "Current Review": "4 - Frequently",
    "Notes": "Matei constantly honors his commitments. He has an interesting structure where for each unit of work he organises a \"to do list\" and carefully makes sure everything is checked",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Is frequently pushing himself in order to deliver team commitments or personal commitments, as an improvement he needs to put some structure on his way of working in order to evaluate/understand better where it is at a certain point in time and what is still necessary to be done in order to deliver it."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "9. Our Colleague’s team members know that they can depend and rely on him/her to expend all reasonable efforts in order to honor the commitments that have been made.",
    "Current Review": "4 - Frequently",
    "Notes": "He's a reliable person who offers his help honoring commitments",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Improved on this aspect by gaining more experience and checking him frequently was nod needed so often as before",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "We all know in the team that we can rely on him and he will always try to honor his commitments but the team needs to check on him frequently to ensure that he understood well the problems to be resolved or he estimates/understands correctly the work that needs to be done or not to overcomplicate what needs to be done. but this is another aspect that the he is improving fast on it."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "10. When the team or their fellow team members are facing a challenge (e.g. operational, deadline, technical) our Colleague proactively seeks to understand how they can help or support in overcoming the challenge.",
    "Current Review": "5 - Always",
    "Notes": "He's always a helping hand, getting involved and oferring support in areas outside his area. FunPod \"dead time\" - asking other teams to help :)",
    "Previous Review": "5 - Always",
    "Notes__1": "With his experience and role he is always trying to support the others with challenges that they are facing",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "Constantly offering help or being available for the other ones if needed."
  },
  {
    "Core area": "Work ethic",
    "Expected behaviour": "11. When faced with a circumstance where our Colleague disagrees with a decision made by the client, a team member, or their manager, our Colleague can constructively disagree, and commit to the decision with which they disagree, and then actively work to support a successful outcome for that decision.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always when facing with contradictory opinions he is committing to the team decisions seeking always to deliver value and learn."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "12. Our colleague notices when their less experienced team members might be struggling with new concepts or tasks and proactively offers coaching or guidance.",
    "Current Review": "",
    "Notes": "Didn't had scenarios to evaluate",
    "Previous Review": "2 - Rarely",
    "Notes__1": "Still not exposed to this situation, only ocasionally inside of the team for spot topics that he was only the one havink knowledge and experience.",
    "Previous Review__1": "1 - Never",
    "Previous Notes": "Was not exposed to this kind of situations till today in order to evaluate this."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "13. When approached by a team member for guidance or assistance, our Colleague readily and enthusiastically renders such assistance.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always available when colleagues asked for help."
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "14. Our Colleague proactively seeks available opportunities (either within QC or outside of QC) to further develop their professional skills. These opportunities might include professional certifications, classes (online or in person), public speaking opportunities, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "Consistent",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Consistent",
    "Previous Review__1": "4 - Frequently",
    "Previous Notes": "He is always eager to learn more about the technologies that we are using, trying to expose himself also to more difficult problems in order to have more learning opportunities. On this topic was a little bit difficult at the beginning to shift his working approach towards a more guided/structured learning approach but he understood very fast the value for doing this and he is frequently seeking to learn more and improve/consolidate his skills"
  },
  {
    "Core area": "Coaching and learning",
    "Expected behaviour": "15. Our Colleague proactively seeks to share their unique skills or knowledge within either their immediate team or the broader QC community. This may include such behaviors as sharing articles of professional interest that are relevant to the QC community, speaking at internal QC events, or seeking to advance a community of like minded practitioners of their craft within the QC community.",
    "Current Review": "3 - Sometimes",
    "Notes": "Internally, in more direct conversations (1:1s) he constantly opens discussions regarding any new knowledge learned. \n\nRecently he also had a cool approach of starting an open discussion with the QC community, targeted toward clarifying some of his knowledge gaps",
    "Previous Review": "2 - Rarely",
    "Notes__1": "Consistent",
    "Previous Review__1": "2 - Rarely",
    "Previous Notes": "This is something that he still needs to build some more confidence and more experience in order to have initiatives in this direction."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "16. Our Colleague actively seeks as well as constructively receives feedback regarding their performance, behavior, and interactions with their immediate team. When presented with both negative and positive feedback, our Colleague strives to understand the feedback and identify opportunities for improvement. Our Colleague does not get defensive or act to criticize the provider of feedback.",
    "Current Review": "5 - Always",
    "Notes": "He understands the importance of provided feedback (positive or negative) and receives it in an constructive manner.\n\nThe suggested improvements can also be reflected immediatly in Matei's work",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Matei had a lot to improve regarding technologies, learning approaches, precess etc. and we did a lot of progress during this short period of time and all this progress was mainly based on his ability to be very open and active on seeking any type of feedback by any team members. More than this he understood well what should be done in order to improve and never get defensive in any feedback discussion."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "17. Our Colleague is enthusiastic, effective, and proactive when communicating (verbal or written) in INTERNAL team or QC settings.",
    "Current Review": "4 - Frequently",
    "Notes": "He started to be more effective during internal team meetings, being more organised and understanding certain time box limitations. Open to more private directed discussions",
    "Previous Review": "3 - Sometimes",
    "Notes__1": "Made progress on this topic contributing on the MM api documentation and is also more effective when communicating inside of the team",
    "Previous Review__1": "2 - Rarely",
    "Previous Notes": "Is enthusiastic on communicating but lacks a little bit on structure and clarity when is communicating. Will also need to improve a little bit more in written communication."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "18. Our Colleague is enthusiastic, effective, and proactive when communicating (verbal or written) in CLIENT facing or more formal EXTERNAL situations.  These will likely include daily standups, client product demos, etc.",
    "Current Review": "4 - Frequently",
    "Notes": "Good communication skills. \n\nVery high technical comprehension, failing sometimes to stay on point.\n\nSometimes it would be great to understand the audience he's discussing with and try to adapt the discussion accordingly, especially when discussing technical solutions with the client. \n\n\"Matei, mai respira",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Made progress on this topic but some times needs to adapt what he communicates to the audience, tends to go in technical details some time that part of the audience is not interested in or doesn't have the knowledge to understand.",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "Similar with previous points but in addition he is able to communicate status or to interact well with the client in meetings etc."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "19. Good communications are essential for creating visibility and understanding in any client service business or any environment where other team members depend on our efforts.  Our Colleague proactively seeks to communicate the amount of information that is necessary and sufficient to create this visibility both for their team and the Client. This includes the timely communication of the current status of their efforts upon the team's behalf, their availability during business hours, and any obstacles where they may need support in order to be successful in their respective role.",
    "Current Review": "4 - Frequently",
    "Notes": "Good and effective. \n\nProactive and a good communication discipline when facing obstacles.",
    "Previous Review": "4 - Frequently",
    "Notes__1": "Improved on this topic by being more focused on communication and not deviating into wider topics",
    "Previous Review__1": "3 - Sometimes",
    "Previous Notes": "He is able to communicate status but he lacks a little bit in structure and clarity some time, his predisposition of thinking of too many things at the same time makes some time his communication not so clear."
  },
  {
    "Core area": "Communication",
    "Expected behaviour": "20. In teams of varied personalities and backgrounds, it is inevitable that team members may disagree or conflict on issues of substance or personality.  Our Colleague navigates conflict situations constructively and understands how to defuse situations without letting them become personal. This includes the consistent ability to communicate a negative message (“I disagree with you for X reasons”) while maintaining a personal respect for their team mate and their role.",
    "Current Review": "5 - Always",
    "Notes": "Consistent",
    "Previous Review": "5 - Always",
    "Notes__1": "Consistent",
    "Previous Review__1": "5 - Always",
    "Previous Notes": "Always respectful with everybody didn't find any conflict situation in which he didn't exit constructively from it."
  }
]
